package com.verio.utils;

import org.springframework.beans.factory.InitializingBean;

/**
 * 信息打印 Bean
 * ==========================================================================
 * 郑重说明：本项目免费开源！原创作者为：薛伟同学，严禁私自出售。
 * ==========================================================================
 * B站账号：薛伟同学
 * 微信公众号：薛伟同学
 * 作者博客：http://xuewei.world
 * ==========================================================================
 * 陆陆续续总会收到粉丝的提醒，总会有些人为了赚取利益倒卖我的开源项目。
 * 不乏有粉丝朋友出现钱付过去，那边只把代码发给他就跑路的，最后还是根据线索找到我。。
 * 希望各位朋友擦亮慧眼，谨防上当受骗！
 * ==========================================================================
 *
 * @author <a href="http://xuewei.world/about">XUEW</a>
 */
public class InfoPrinter implements InitializingBean {

    @Override
    public void afterPropertiesSet() throws Exception {
        System.out.println("\n" +
                " ==========================================================================\n" +
                " 郑重说明：本项目免费开源！原创作者为：薛伟同学，严禁私自出售。\n" +
                " ==========================================================================\n" +
                " B站账号：薛伟同学\n" +
                " 微信公众号：薛伟同学\n" +
                " 作者博客：http://xuewei.world\n" +
                " ==========================================================================\n" +
                " 陆陆续续总会收到粉丝的提醒，总会有些人为了赚取利益倒卖我的开源项目。\n" +
                " 不乏有粉丝朋友出现钱付过去，那边只把代码发给他就跑路的，最后还是根据线索找到我。。\n" +
                " 希望各位朋友擦亮慧眼，谨防上当受骗！\n" +
                " ==========================================================================" +
                "\n");
    }
}
